# ServerSupportsIFCLinks Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceServerUtils..::..ServerSupportsIFCLinks Method
ExternalResourceServerUtils Class See Also
---
Checks that the server referenced by the given ExternalResourceReference supports IFC links.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool ServerSupportsIFCLinks(
	ExternalResourceReference extRef
)
```

Visual Basic
---
```text
Public Shared Function ServerSupportsIFCLinks ( _
	extRef As ExternalResourceReference _
) As Boolean
```

Visual C++
---
```text
public:
static bool ServerSupportsIFCLinks(
	ExternalResourceReference^ extRef
)
```

# ### Parameters
extRef
    Type: Autodesk.Revit.DB..::..ExternalResourceReference The ExternalResourceReference to check.
# ### Return Value
True if the ExternalResourceReference refers to a server that supports IFC links. False otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExternalResourceServerUtils Class
Autodesk.Revit.DB Namespace